<a href="https://colab.research.google.com/github/lisabroadhead/data-structures-algorithms-python/blob/master/olympian.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Find average height per individual olympian per year exercise (Core)

## 1.  Load this dataset and explore it! Answer the following questions:

In [102]:
import pandas as pd
import numpy as np

In [103]:
file = "/content/drive/MyDrive/Colab Notebooks/coding_dojo/files/athleteEventsNoPersonal.csv"
df = pd.read_csv(file)

In [105]:
df.head()

,ID,Age,Height,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,5,21.0,185.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN
1,5,21.0,185.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,"Speed Skating Women's 1,000 metres",NaN
2,5,25.0,185.0,Netherlands,NED,1992 Winter,1992,Winter,Albertville,Speed Skating,Speed Skating Women's 500 metres,NaN
3,5,25.0,185.0,Netherlands,NED,1992 Winter,1992,Winter,Albertville,Speed Skating,"Speed Skating Women's 1,000 metres",NaN
4,5,27.0,185.0,Netherlands,NED,1994 Winter,1994,Winter,Lillehammer,Speed Skating,Speed Skating Women's 500 metres,NaN

### a. How many rows?

In [106]:
print(f"{df.shape[0]} : rows")

40616 : rows

### a. How many columns?

In [107]:
print(f"{df.shape[1]} : columns")

12 : columns

### c. Which columns have missing values? (Why do think there are there so many null values in the Medals column?)

In [108]:
df.isna().sum()

ID            0
Age        1473
Height     9001
Team          0
NOC           0
Games         0
Year          0
Season        0
City          0
Sport         0
Event         0
Medal     34699
dtype: int64

In [109]:
# Missing values in the medals because there are only 3 medals given out and there are more athletes to medals. Not everyone will get a medal

###  d. How many entries correspond to the city of London?

In [110]:
london = df['City'] == "London"
print(f"{london.sum()} : london entries")

3370 : london entries

 ### e. What age is the youngest athlete in our sample data?  Hint: use min()

In [111]:
print(f"{df['Age'].min()} youngest olympic athlete")

11.0 youngest olympic athlete

## 2. Create filters to find out:

###  a. How many athletes who participated in the Sport "Tug-Of-War" were from Team "Sweden" in our sample dataset?

In [ ]:
df.info()

In [113]:
tug = df['Sport'] == "Tug-Of-War"
country = df['Team'] == "Sweden"
total = df[tug & country]

print(f"{total.shape[0]} : Swedish Tug-Of-War athletes")

6 : Swedish Tug-Of-War athletes

In [114]:
# tug.isna().sum()
# country.isna().sum()

### b. How many Gold medals were awarded to athletes who were over 40 years old?

In [115]:
gold = df['Medal'] == "Gold"
forty = df['Age'] > 40
total = df[gold & forty]

print(f"{total.shape[0]} athletes over 40 and won gold")

66 athletes over 40 and won gold

## 3. Determine the average height if:

### a. All rows are included.

In [116]:
df.isna().sum()

ID            0
Age        1473
Height     9001
Team          0
NOC           0
Games         0
Year          0
Season        0
City          0
Sport         0
Event         0
Medal     34699
dtype: int64

In [117]:
df['Height'].fillna(value=df['Height'].mean(), inplace=True)

In [118]:
df.info().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 40616 entries, 0 to 40615
Data columns (total 12 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      40616 non-null  int64
 1   Age     39143 non-null  float64
 2   Height  40616 non-null  float64
 3   Team    40616 non-null  object
 4   NOC     40616 non-null  object
 5   Games   40616 non-null  object
 6   Year    40616 non-null  int64
 7   Season  40616 non-null  object
 8   City    40616 non-null  object
 9   Sport   40616 non-null  object
 10  Event   40616 non-null  object
 11  Medal   5917 non-null   object
dtypes: float64(2), int64(2), object(8)
memory usage: 3.7+ MB

AttributeError: ignored

In [119]:
print(f"{round(df['Height'].mean(), 2)} : average height")

175.38 : average height

###  b. All rows are included but grouped by Event.

In [120]:
df.groupby(['Event'])['Height'].mean()

Event
Alpine Skiing Men's Combined                      177.744508
Alpine Skiing Men's Downhill                      177.422101
Alpine Skiing Men's Giant Slalom                  176.334801
Alpine Skiing Men's Slalom                        176.161591
Alpine Skiing Men's Super G                       179.193301
                                                     ...
Wrestling Women's Flyweight, Freestyle            158.100000
Wrestling Women's Heavyweight, Freestyle          173.444444
Wrestling Women's Light-Heavyweight, Freestyle    170.000000
Wrestling Women's Lightweight, Freestyle          162.666667
Wrestling Women's Middleweight, Freestyle         164.533333
Name: Height, Length: 726, dtype: float64

### c. Bonus: Fin average height of all the athletes, but don't want to include any athlete more than once.  

Hint: We learned how to drop duplicates if EVERY column was identical

Hint: Now we want to drop a row any time just the ID is repeated.  To do this,  you can use a subset of your data as an argument in the drop_duplicates function.  You can also tell Python which of the duplicates to keep by using the keep argument.

In [121]:
df.duplicated().sum()

207

In [122]:
# drops the identical rows
new_df = df.drop_duplicates()

In [123]:
df.duplicated().sum()

207

In [124]:
# drops identical ids
new_df = df.drop_duplicates(subset=['ID'])

In [126]:
df.shape, new_df.shape

((40616, 12), (20336, 12))